# DataFrames

In [1]:
import numpy as np
import pandas as pd

In [15]:
from numpy.random import randn
np.random.seed(1)

In [10]:
randn(5)

array([-0.51865563, -1.23162818,  1.41564571, -0.74835859,  1.46170089])

In [12]:
df = pd.DataFrame(randn(5, 4), index = 'A B C D E'.split(),  columns='W X Y Z'.split())

In [13]:
df

          W         X         Y         Z
A -1.579445 -0.579578  0.045320 -0.869413
B -0.681035  1.287201  0.336650  0.316602
C  0.446800  0.050734 -1.062972  0.862927
D  0.618029 -0.023161  1.697896 -0.104850
E -0.574532 -0.360032  0.975488 -0.916020

# Selection and indexing

In [16]:
df['W']

A   -1.579445
B   -0.681035
C    0.446800
D    0.618029
E   -0.574532
Name: W, dtype: float64

In [18]:
type(df['W'])

pandas.core.series.Series

In [19]:
type(df)

pandas.core.frame.DataFrame

In [21]:
df[['W','Z']] # to call two columns we must make it list

          W         Z
A -1.579445 -0.869413
B -0.681035  0.316602
C  0.446800  0.862927
D  0.618029 -0.104850
E -0.574532 -0.916020

In [22]:
df[['W']]

          W
A -1.579445
B -0.681035
C  0.446800
D  0.618029
E -0.574532

In [ ]:
df[['Z','W']] # order does not make sense

In [24]:
df.W # it's like df['W'], but second one is preferable

A   -1.579445
B   -0.681035
C    0.446800
D    0.618029
E   -0.574532
Name: W, dtype: float64

# Create new column

In [25]:
df['new'] = df['W'] + df['Z']

In [26]:
df

          W         X         Y         Z       new
A -1.579445 -0.579578  0.045320 -0.869413 -2.448858
B -0.681035  1.287201  0.336650  0.316602 -0.364433
C  0.446800  0.050734 -1.062972  0.862927  1.309727
D  0.618029 -0.023161  1.697896 -0.104850  0.513179
E -0.574532 -0.360032  0.975488 -0.916020 -1.490552

In [29]:
df['zeros'] = np.zeros(5, dtype =int)

In [31]:
df['K'] = 0 # It's the same like previous, but this better

In [32]:
df

          W         X         Y         Z       new  zeros  K
A -1.579445 -0.579578  0.045320 -0.869413 -2.448858      0  0
B -0.681035  1.287201  0.336650  0.316602 -0.364433      0  0
C  0.446800  0.050734 -1.062972  0.862927  1.309727      0  0
D  0.618029 -0.023161  1.697896 -0.104850  0.513179      0  0
E -0.574532 -0.360032  0.975488 -0.916020 -1.490552      0  0

# Removing Columns

In [42]:
df.drop('K', axis = 1) # it's just shows future result, but data is remaining same

KeyError: "['K'] not found in axis"

In [40]:
df.drop('K', axis = 1, inplace=True) # it's save the result

          W         X         Y         Z       new  zeros
A -1.579445 -0.579578  0.045320 -0.869413 -2.448858      0
B -0.681035  1.287201  0.336650  0.316602 -0.364433      0
C  0.446800  0.050734 -1.062972  0.862927  1.309727      0
D  0.618029 -0.023161  1.697896 -0.104850  0.513179      0
E -0.574532 -0.360032  0.975488 -0.916020 -1.490552      0

In [43]:
df = df.drop('K', axis =1)# it's like the previous one, the result is the same

KeyError: "['K'] not found in axis"

In [45]:
df.drop('E', axis = 0)

          W         X         Y         Z       new  zeros
A -1.579445 -0.579578  0.045320 -0.869413 -2.448858      0
B -0.681035  1.287201  0.336650  0.316602 -0.364433      0
C  0.446800  0.050734 -1.062972  0.862927  1.309727      0
D  0.618029 -0.023161  1.697896 -0.104850  0.513179      0

In [46]:
df

          W         X         Y         Z       new  zeros
A -1.579445 -0.579578  0.045320 -0.869413 -2.448858      0
B -0.681035  1.287201  0.336650  0.316602 -0.364433      0
C  0.446800  0.050734 -1.062972  0.862927  1.309727      0
D  0.618029 -0.023161  1.697896 -0.104850  0.513179      0
E -0.574532 -0.360032  0.975488 -0.916020 -1.490552      0

# Select Rows

In [47]:
df.loc['A']

W       -1.579445
X       -0.579578
Y        0.045320
Z       -0.869413
new     -2.448858
zeros    0.000000
Name: A, dtype: float64

In [49]:
df.iloc[1] # it's an original index, index loc, besides A, B, C ... E it shows 0, 1, ... , n

W       -0.681035
X        1.287201
Y        0.336650
Z        0.316602
new     -0.364433
zeros    0.000000
Name: B, dtype: float64

# Selecting sub of rows and columns

In [50]:
df.loc['B', 'Y']

0.33664989646317683

In [53]:
df.loc[['A', 'C'], ['W', 'Y']] # sub table, with loc we can get subdataframe, that we want

          W         Y
A -1.579445  0.045320
C  0.446800 -1.062972

# Conditional selection

In [54]:
df > 0

       W      X      Y      Z    new  zeros
A  False  False   True  False  False  False
B  False   True   True   True  False  False
C   True   True  False   True   True  False
D   True  False   True  False   True  False
E  False  False   True  False  False  False

In [55]:
df[df > 0]

          W         X         Y         Z       new  zeros
A       NaN       NaN  0.045320       NaN       NaN    NaN
B       NaN  1.287201  0.336650  0.316602       NaN    NaN
C  0.446800  0.050734       NaN  0.862927  1.309727    NaN
D  0.618029       NaN  1.697896       NaN  0.513179    NaN
E       NaN       NaN  0.975488       NaN       NaN    NaN

In [56]:
df['W'] > 0

A    False
B    False
C     True
D     True
E    False
Name: W, dtype: bool

In [57]:
df[df['W'] > 0] # shows only this rows, that TRUE

          W         X         Y         Z       new  zeros
C  0.446800  0.050734 -1.062972  0.862927  1.309727      0
D  0.618029 -0.023161  1.697896 -0.104850  0.513179      0

In [60]:
df.loc['A'] > 0

W        False
X        False
Y         True
Z        False
new      False
zeros    False
Name: A, dtype: bool

In [64]:
df[df['W'] > 0]['Y']

C   -1.062972
D    1.697896
Name: Y, dtype: float64

In [68]:
df[df['W'] > 0][['X', 'Y']]

          X         Y
C  0.050734 -1.062972
D -0.023161  1.697896

In [ ]:
df['W' > 0]

In [69]:
df['Y'] > 0.5

A    False
B    False
C    False
D     True
E     True
Name: Y, dtype: bool

In [74]:
df[(df['W'] < 0) | (df['Y'] > 0.5)]

          W         X         Y         Z       new  zeros
A -1.579445 -0.579578  0.045320 -0.869413 -2.448858      0
B -0.681035  1.287201  0.336650  0.316602 -0.364433      0
D  0.618029 -0.023161  1.697896 -0.104850  0.513179      0
E -0.574532 -0.360032  0.975488 -0.916020 -1.490552      0

In [ ]:
df[(df['W'] > 0) & (df['Y'] > 0.5)]

# More Index Details

In [75]:
df.reset_index() # reset with common indexes 0, ... , n. It shows result as well

  index         W         X         Y         Z       new  zeros
0     A -1.579445 -0.579578  0.045320 -0.869413 -2.448858      0
1     B -0.681035  1.287201  0.336650  0.316602 -0.364433      0
2     C  0.446800  0.050734 -1.062972  0.862927  1.309727      0
3     D  0.618029 -0.023161  1.697896 -0.104850  0.513179      0
4     E -0.574532 -0.360032  0.975488 -0.916020 -1.490552      0

In [77]:
df

          W         X         Y         Z       new  zeros
A -1.579445 -0.579578  0.045320 -0.869413 -2.448858      0
B -0.681035  1.287201  0.336650  0.316602 -0.364433      0
C  0.446800  0.050734 -1.062972  0.862927  1.309727      0
D  0.618029 -0.023161  1.697896 -0.104850  0.513179      0
E -0.574532 -0.360032  0.975488 -0.916020 -1.490552      0

In [78]:
newind = 'USA GER FRA KAZ JAP'.split()

In [79]:
df['Country'] = newind

In [81]:
df

          W         X         Y         Z       new  zeros Country
A -1.579445 -0.579578  0.045320 -0.869413 -2.448858      0     USA
B -0.681035  1.287201  0.336650  0.316602 -0.364433      0     GER
C  0.446800  0.050734 -1.062972  0.862927  1.309727      0     FRA
D  0.618029 -0.023161  1.697896 -0.104850  0.513179      0     KAZ
E -0.574532 -0.360032  0.975488 -0.916020 -1.490552      0     JAP

In [82]:
df.set_index('Country') # Replace indexes with column that you indicate. ALSO SHOWS ONLY RESULT

                W         X         Y         Z       new  zeros
Country
USA     -1.579445 -0.579578  0.045320 -0.869413 -2.448858      0
GER     -0.681035  1.287201  0.336650  0.316602 -0.364433      0
FRA      0.446800  0.050734 -1.062972  0.862927  1.309727      0
KAZ      0.618029 -0.023161  1.697896 -0.104850  0.513179      0
JAP     -0.574532 -0.360032  0.975488 -0.916020 -1.490552      0

In [83]:
df

          W         X         Y         Z       new  zeros Country
A -1.579445 -0.579578  0.045320 -0.869413 -2.448858      0     USA
B -0.681035  1.287201  0.336650  0.316602 -0.364433      0     GER
C  0.446800  0.050734 -1.062972  0.862927  1.309727      0     FRA
D  0.618029 -0.023161  1.697896 -0.104850  0.513179      0     KAZ
E -0.574532 -0.360032  0.975488 -0.916020 -1.490552      0     JAP

# Multi-index and Index Hierarchy

In [93]:
outside = ['G1', 'G1', 'G1', 'G2', 'G2', 'G2']
inside = [1, 2,3,1,2,3]

In [94]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [95]:
hier_index = list(zip(outside,inside))

In [96]:
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [97]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [98]:
df = pd.DataFrame(np.random.randn(6, 2), index = hier_index)

In [99]:
df

             0         1
G1 1  1.624345 -0.611756
   2 -0.528172 -1.072969
   3  0.865408 -2.301539
G2 1  1.744812 -0.761207
   2  0.319039 -0.249370
   3  1.462108 -2.060141

In [100]:
df.loc['G1']

          0         1
1  1.624345 -0.611756
2 -0.528172 -1.072969
3  0.865408 -2.301539

In [102]:
df.loc['G1'].loc[1]

0    1.624345
1   -0.611756
Name: 1, dtype: float64

In [107]:
df.index.names = ['Groups', 'Num'] # change names of indexes

ValueError: Length of names must match number of levels in MultiIndex.

In [109]:
df

                   0         1
Groups Num
G1     1    1.624345 -0.611756
       2   -0.528172 -1.072969
       3    0.865408 -2.301539
G2     1    1.744812 -0.761207
       2    0.319039 -0.249370
       3    1.462108 -2.060141

In [110]:
df.xs(['G1', 1]) # What it will do?

C:\Users\aliha\AppData\Local\Temp/ipykernel_31572/2011919136.py:1: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df.xs(['G1', 1])

0    1.624345
1   -0.611756
Name: (G1, 1), dtype: float64

In [112]:
df.xs(1, level='Num') # run it hom

               0         1
Groups
G1      1.624345 -0.611756
G2      1.744812 -0.761207